# CADLinkOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CADLinkOptions Class
Members See Also
---
This class contains the options in use when or reloading a CAD link type (DWG, DXF, etc.)
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class CADLinkOptions : IDisposable
```

Visual Basic
---
```text
Public Class CADLinkOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class CADLinkOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..CADLinkOptions
# See Also
CADLinkOptions Members
Autodesk.Revit.DB Namespace